# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)



### Step 1. Import the necessary libraries

In [8]:
import pandas as pd
import numpy as np

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

### Step 3. Assign each to a to a variable called cars1 and cars2

In [9]:
cars1 = pd.read_csv("https://raw.githubusercontent.com/thieu1995/csv-files/main/data/pandas/cars1.csv")
cars2 = pd.read_csv("https://raw.githubusercontent.com/thieu1995/csv-files/main/data/pandas/cars2.csv")

print(cars1.head())
print(cars2.head())

    mpg  cylinders  displacement horsepower  weight  acceleration  model  \
0  18.0          8           307        130    3504          12.0     70
1  15.0          8           350        165    3693          11.5     70
2  18.0          8           318        150    3436          11.0     70
3  16.0          8           304        150    3433          12.0     70
4  17.0          8           302        140    3449          10.5     70

   origin                        car  Unnamed: 9  Unnamed: 10  Unnamed: 11  \
0       1  chevrolet chevelle malibu         NaN          NaN          NaN
1       1          buick skylark 320         NaN          NaN          NaN
2       1         plymouth satellite         NaN          NaN          NaN
3       1              amc rebel sst         NaN          NaN          NaN
4       1                ford torino         NaN          NaN          NaN

   Unnamed: 12  Unnamed: 13
0          NaN          NaN
1          NaN          NaN
2          NaN          NaN
3          NaN          NaN
4          NaN          NaN
    mpg  cylinders  displacement horsepower  weight  acceleration  model  \
0  33.0          4            91         53    1795          17.4     76
1  20.0          6           225        100    3651          17.7     76
2  18.0          6           250         78    3574          21.0     76
3  18.5          6           250        110    3645          16.2     76
4  17.5          6           258         95    3193          17.8     76

   origin                 car
0       3         honda civic
1       1      dodge aspen se
2       1   ford granada ghia
3       1  pontiac ventura sj
4       1       amc pacer d/l

### Step 4. Oops, it seems our first dataset has some unnamed blank columns, fix cars1

In [10]:
cars1 = cars1.loc[:, "mpg":"car"]
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 5. What is the number of observations in each dataset?

In [11]:
print(cars1.shape)
print(cars2.shape)

(198, 9)
(200, 9)

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [12]:
cars = cars1.append(cars2)
cars

C:\Users\Yoga\AppData\Local\Temp\ipykernel_25376\421006426.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  cars = cars1.append(cars2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
195,27.0,4,140,86,2790,15.6,82,1,ford mustang gl
196,44.0,4,97,52,2130,24.6,82,2,vw pickup
197,32.0,4,135,84,2295,11.6,82,1,dodge rampage
198,28.0,4,120,79,2625,18.6,82,1,ford ranger
199,31.0,4,119,82,2720,19.4,82,1,chevy s-10

### Step 7. Oops, there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [13]:
nr_owners = np.random.randint(15000, high=73001, size=398, dtype='l')
nr_owners

array([53073, 17089, 57368, 30419, 58513, 49907, 22163, 30826, 40176,
       62451, 27683, 48784, 16991, 59954, 36829, 20740, 33877, 72560,
       55202, 65781, 46971, 46915, 51707, 71679, 54712, 36633, 27879,
       38907, 63031, 56259, 72971, 62961, 47062, 58239, 36328, 29229,
       40055, 37807, 50881, 72310, 32637, 38429, 43829, 70921, 70172,
       60187, 61457, 66836, 39139, 34980, 25564, 72365, 40578, 20468,
       30963, 27833, 54914, 30065, 55169, 27543, 19010, 47679, 61495,
       58731, 65530, 64178, 50841, 70052, 64999, 68856, 64182, 43747,
       62070, 22130, 24194, 30047, 37846, 18063, 16540, 38036, 64765,
       29332, 69273, 37893, 42577, 62657, 69487, 19742, 32246, 49841,
       63098, 38990, 48684, 52610, 42262, 50531, 31351, 64532, 69673,
       71581, 64527, 71998, 40856, 45495, 23692, 25342, 20097, 27495,
       27838, 22433, 41531, 64251, 47216, 67129, 33737, 42320, 54888,
       70758, 21401, 60501, 34862, 29767, 63988, 30126, 44901, 38129,
       17047, 24305, 24117, 55836, 55990, 63213, 53757, 41554, 39059,
       22193, 33799, 37218, 35291, 57963, 26395, 28671, 66942, 49843,
       22075, 38124, 67009, 68097, 18506, 46803, 60338, 19576, 66932,
       55583, 49484, 59970, 31206, 60698, 38655, 51762, 62683, 39708,
       28096, 56312, 57122, 40070, 26330, 43102, 37539, 42123, 40580,
       56892, 63312, 33299, 50356, 69315, 45495, 47899, 39319, 37635,
       68159, 45428, 60918, 54093, 26294, 46921, 44339, 38535, 30328,
       59082, 40774, 30311, 33481, 20656, 63059, 51823, 48925, 43266,
       57997, 30624, 50674, 61293, 61121, 49273, 71244, 54246, 15050,
       33065, 64183, 72185, 30011, 58244, 22748, 60808, 46552, 64129,
       72741, 19983, 34443, 25003, 35247, 26827, 25711, 66667, 63590,
       56168, 40025, 24082, 26895, 62722, 33265, 62594, 25846, 35745,
       57205, 39928, 56164, 54648, 45302, 53845, 18858, 65880, 20799,
       53175, 28210, 24083, 59925, 41611, 52800, 69927, 41303, 48549,
       61775, 45686, 70800, 27130, 57561, 56369, 27207, 47263, 31212,
       56490, 53691, 61187, 43555, 27826, 37830, 52284, 71825, 56572,
       67620, 29503, 37625, 41356, 25944, 16624, 60758, 26150, 33392,
       62550, 16762, 42661, 22750, 15908, 68788, 40239, 60298, 22335,
       29386, 27380, 26083, 42651, 20808, 44903, 51379, 33889, 72619,
       59507, 43491, 27157, 19447, 43912, 66413, 68744, 46206, 35145,
       43858, 65959, 29773, 64758, 65770, 24744, 72228, 24515, 18199,
       51216, 51248, 28290, 62392, 43140, 43989, 27882, 61700, 44658,
       69493, 25490, 45343, 66197, 56189, 19160, 46065, 22238, 53100,
       35581, 31827, 44050, 52508, 68552, 48861, 46180, 15721, 16121,
       52088, 49994, 40615, 35758, 65626, 43316, 22721, 23270, 31949,
       30458, 17419, 23583, 53446, 31035, 64511, 38082, 25644, 66535,
       34514, 57717, 35227, 68781, 17698, 68491, 63213, 36031, 54255,
       15543, 21516, 57460, 34519, 59964, 35067, 43664, 22504, 65241,
       36710, 15850, 51494, 48063, 55473, 66352, 52506, 33115, 67140,
       33157, 63567, 22047, 53534, 41140, 56796, 17705, 27295, 60823,
       49499, 55428])

### Step 8. Add the column owners to cars

In [14]:
cars['owners'] = nr_owners
cars.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
195,27.0,4,140,86,2790,15.6,82,1,ford mustang gl,17705
196,44.0,4,97,52,2130,24.6,82,2,vw pickup,27295
197,32.0,4,135,84,2295,11.6,82,1,dodge rampage,60823
198,28.0,4,120,79,2625,18.6,82,1,ford ranger,49499
199,31.0,4,119,82,2720,19.4,82,1,chevy s-10,55428